backend/app/controllers/tasks_controller.rb

        task = Team.find_by(id: params[:id])
        team.tasks.create(title: params[:title], due_date: params[:due_date], urgency: params[:urgency], description: params[:description])
        render json: team.tasks.last
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "tasks" ("due_date", "urgency", "description", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["due_date", "2020-05-01"], ["urgency", true], ["description", "This is a new task"], ["team_id", 3], ["created_at", "2020-03-09 16:53:33.354788"], ["updated_at", "2020-03-09 16:53:33.354788"]]
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" DESC LIMIT $1  [["LIMIT", 1]]

        task = Task.find_by(id: params[:id])
        task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 13]]