backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "complete" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["complete", true], ["updated_at", "2020-03-15 15:52:51.156278"], ["id", 6]]
---
        task = Task.find_by(id: params[:id])
        task.update(complete: params[:complete])