backend/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
    def index
        teams = Team.all

INSERT INTO "teams" ("name", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["created_at", "2020-03-12 15:35:41.173061"], ["updated_at", "2020-03-12 15:35:41.173061"], ["slug", "1c40e981-2756-410b-8db9-f89fbfd54a12"]]
---
    def create
        team = Team.create(name: params[:name])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        # team = Team.friendly.find(params[:id])
        team = Team.find(params[:id])